Revit 2027 API
ExternalResourceUtils.GetAllExternalResourceReferences(Document) Method
 Gets the ids of all elements which refer to external resources.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> GetAllExternalResourceReferences(
	Document document
)
Public Shared Function GetAllExternalResourceReferences (
	document As Document
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ GetAllExternalResourceReferences(
	Document^ document
)
static member GetAllExternalResourceReferences :
        document : Document -> ISet<ElementId>
Parameters
document Document
 The Revit Document containing the external resource references.
Return Value
ISet<ElementId>
 The ids of all elements which refer to external resources.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This function will not return the ids of nested Revit links; it only returns top-level references.
See Also
Reference
ExternalResourceUtils Class
GetAllExternalResourceReferences Overload
Autodesk.Revit.DB Namespace